controllers/SiteController.php

SELECT * FROM `book` ORDER BY `data_add` DESC LIMIT 8
---
    public function actionIndex()
    {

        $modelBook=Book::getDb()->cache(function($Book){
            return Book::find()
                ->orderBy('data_add' )
                ->indexBy('id')
                ->asArray()
                ->orderBy('data_add DESC')->limit(8)->all();

SELECT * FROM `user` WHERE `id`=4
UPDATE `user` SET `dataEndEnter`=1500919882 WHERE `login`='admin'
---
    protected  function onlain()
    {

        if (!Yii::$app->user->isGuest) {
            $user = \app\models\User::find()->where(['id' => Yii::$app->user->identity->id])->one();
            $user->dataEndEnter = time();

            $user->save();