components/NewsWidget.php

SELECT * FROM `news` ORDER BY `id` DESC
---
    public function run()
    {
        $newsModel=News::getDb()->cache(function($News){

            return News::find()->indexBy('id')->asArray()->orderBy('id DESC')->all();