components/OnlainWidget.php

SELECT `login`, `onlain`, `dataEndEnter` FROM `user`
---
   public function run()
   {
       $time=time();

       $user=User::find()->select('login,onlain,dateEndEnter')->asArray()->all();